{
  "O": 0,
  "B-spatial_relation": 1,
  "S-country": 2,
  "S-restaurant_type": 3,
  "B-object_name": 4,
  "B-party_size_description": 5,
  "S-object_select": 6,
  "S-party_size_number": 7,
  "B-timeRange": 8,
  "S-rating_value": 9,
  "B-playlist": 10,
  "S-rating_unit": 11,
  "B-geographic_poi": 12,
  "S-object_type": 13,
  "B-artist": 14,
  "B-object_type": 15,
  "S-track": 16,
  "S-restaurant_name": 17,
  "S-object_name": 18,
  "B-country": 19,
  "B-entity_name": 20,
  "B-restaurant_type": 21,
  "S-album": 22,
  "S-artist": 23,
  "S-condition_temperature": 24,
  "B-restaurant_name": 25,
  "S-city": 26,
  "S-playlist_owner": 27,
  "B-movie_name": 28,
  "S-spatial_relation": 29,
  "<GO>": 30,
  "B-service": 31,
  "<EOS>": 32,
  "S-best_rating": 33,
  "S-music_item": 34,
  "S-year": 35,
  "S-sort": 36,
  "S-state": 37,
  "S-movie_type": 38,
  "B-city": 39,
  "B-object_location_type": 40,
  "B-movie_type": 41,
  "B-sort": 42,
  "S-service": 43,
  "S-entity_name": 44,
  "B-location_name": 45,
  "B-current_location": 46,
  "B-playlist_owner": 47,
  "S-served_dish": 48,
  "S-object_location_type": 49,
  "B-track": 50,
  "B-poi": 51,
  "S-playlist": 52,
  "S-condition_description": 53,
  "S-genre": 54,
  "B-state": 55,
  "B-served_dish": 56,
  "S-cuisine": 57,
  "B-album": 58,
  "S-timeRange": 59,
  "B-facility": 60,
  "S-facility": 61,
  "B-cuisine": 62,
  "B-music_item": 63,
  "B-object_select": 64,
  "S-current_location": 65,
  "S-object_part_of_series_type": 66,
  "S-geographic_poi": 67,
  "S-movie_name": 68,
  "S-poi": 69,
  "B-genre": 70,
  "S-location_name": 71,
  "E-service": 72,
  "I-entity_name": 73,
  "E-entity_name": 74,
  "E-playlist": 75,
  "I-playlist": 76,
  "B-object_part_of_series_type": 77,
  "I-track": 78,
  "E-track": 79,
  "E-artist": 80,
  "I-artist": 81,
  "E-movie_name": 82,
  "I-movie_name": 83,
  "I-timeRange": 84,
  "E-timeRange": 85,
  "E-object_type": 86,
  "I-spatial_relation": 87,
  "E-spatial_relation": 88,
  "I-geographic_poi": 89,
  "E-geographic_poi": 90,
  "E-city": 91,
  "I-city": 92,
  "I-party_size_description": 93,
  "E-party_size_description": 94,
  "E-object_location_type": 95,
  "I-object_name": 96,
  "E-object_name": 97,
  "E-movie_type": 98,
  "E-sort": 99,
  "I-location_name": 100,
  "E-location_name": 101,
  "E-current_location": 102,
  "E-playlist_owner": 103,
  "I-playlist_owner": 104,
  "E-poi": 105,
  "I-poi": 106,
  "E-restaurant_name": 107,
  "I-restaurant_name": 108,
  "E-state": 109,
  "I-state": 110,
  "I-served_dish": 111,
  "E-served_dish": 112,
  "I-album": 113,
  "E-album": 114,
  "E-country": 115,
  "I-country": 116,
  "E-facility": 117,
  "E-cuisine": 118,
  "E-music_item": 119,
  "E-object_select": 120,
  "E-restaurant_type": 121,
  "I-restaurant_type": 122,
  "E-object_part_of_series_type": 123,
  "E-genre": 124,
  "I-genre": 125
}